uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/ОтражениеДокументовПоШаблонам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовПоШаблонам</name>
  <resources>
    <name>УдалитьСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиДоЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтбора</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписиПослеЗакрытияПериода</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСторноПервогоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ПериодОтражения</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДокументПоследнегоОтражения</name>
    <type>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериодаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроведениеОтменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеФоновымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>DocumentRef.УчетнаяПолитикаМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ОтраженоВСледующемПериоде</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособТрансляции</name>
    <type>
      <types>EnumRef.СпособыТрансляции</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбработкаВыполнена</name>
    <type>
      <types>EnumRef.ДаНет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонОперации</name>
    <type>
      <types>CatalogRef.ШаблоныТрансформационныхКорректировок</types>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Трансляция</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/НаправленияТрансляцииДанных/НаправленияТрансляцииДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияТрансляцииДанных</name>
  <enumValues>
    <name>ПоказателиВПоказатели</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказатели</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыеРегистрыВРегистрБухгалтерии</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиБДДС</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиБДР</name>
  </enumValues>
  <enumValues>
    <name>РегистрБухгалтерииВПоказателиРесурсы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ОтражениеДокументовПоШаблонам/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	
	ОписаниеОЗакрытии = Новый ОписаниеОповещения("ОбработкаДокументов_Завершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ОтражениеДокументовПоШаблонам.Форма.ФормаНастройкиОбработки",, , , , , ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДокументов_Завершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ВыбранноеЗначение.СпособОбработки="Выделенные" Тогда 
		
		МассивДокументов=Новый Массив;
		
		Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
			
			МассивДокументов.Добавить(Элементы.Список.ДанныеСтроки(Строка).ИсходныйДокумент);
			
		КонецЦикла;
		
	Иначе
		
		МассивДокументов=Неопределено;
		
	КонецЕсли;
		
	ДлительнаяОперация=ОбработатьМассивДокументовНаСервере(ВыбранноеЗначение.ВключаяОбработанные,МассивДокументов);	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьДанныеСписка", ЭтотОбъект);
	
	Если ДлительнаяОперация.Статус = "Выполнено"
		Или ДлительнаяОперация.Статус = "Отменено" Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ДлительнаяОперация);
		
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания             = Истина;
		ПараметрыОжидания.ТекстСообщения                   = НСтр("ru = 'Выполняется отражение документов по шаблонам'");
		ПараметрыОжидания.ОповещениеПользователя.Показать  = Истина;
		ПараметрыОжидания.ОповещениеПользователя.Текст     = НСтр("ru = 'Выполняется отражение документов по шаблонам'");
		ПараметрыОжидания.ОповещениеПользователя.Пояснение = НСтр("ru = 'Выполняется отражение документов по шаблонам'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеСписка(Результат, ДополнительныеПараметры) Экспорт
	
    Элементы.Список.Обновить();
	
КонецПроцедуры // ОбновитьДанныеСписка()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Поле.Имя="ДокументПервогоОтражения"
		ИЛИ Поле.Имя="ДокументПоследнегоОтражения"
		ИЛИ Поле.Имя="ДокументСторноПервогоОтражения"
		ИЛИ Поле.Имя="ИсходныйДокумент" Тогда
		
		СтандартнаяОбработка=Ложь;
		РабочийДокумент=Элементы.Список.ТекущиеДанные[Поле.Имя];
		
		Если НЕ ЗначениеЗаполнено(РабочийДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(,РабочийДокумент);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаправлениеТрансляции(ШаблонОперации)
	
	Если ТипЗнч(ШаблонОперации)=Тип("СправочникСсылка.ШаблоныТрансформационныхКорректировок") Тогда
		
		Возврат "РегистрБухгалтерии";
		
	Иначе
		
		Возврат ?(ШаблонОперации.НаправлениеТрансляции=Перечисления.НаправленияТрансляцииДанных.РегистрБухгалтерииВРегистрБухгалтерии,"РегистрБухгалтерии","ПоказателиОтчетов");
		
	КонецЕсли;
	
КонецФункции // ПолучитьНаправлениеТрансляции()

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	
	Поле=Элементы.Список.ТекущийЭлемент;
	
	Если Поле=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Поле.Имя="ДокументПервогоОтражения"
		ИЛИ Поле.Имя="ДокументПоследнегоОтражения"
		ИЛИ Поле.Имя="ДокументСторноПервогоОтражения"
		ИЛИ Поле.Имя="ИсходныйДокумент" Тогда
		
		РабочийДокумент=Элементы.Список.ТекущиеДанные[Поле.Имя];
		
		Если НЕ ЗначениеЗаполнено(РабочийДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		Если Поле.Имя="ИсходныйДокумент" Тогда
			
			ОткрытьФорму("Обработка.ДвиженияДокумента.Форма",Новый Структура("ДокументСсылка",РабочийДокумент),ЭтаФорма,Новый УникальныйИдентификатор);
			
		Иначе	
			
			НаправлениеТрансляции=ПолучитьНаправлениеТрансляции(Элементы.Список.ТекущиеДанные.ШаблонОперации);
			
			Если НаправлениеТрансляции="РегистрБухгалтерии" Тогда
				
				ОткрытьФорму("Обработка.ДвиженияДокумента.Форма",Новый Структура("ДокументСсылка",РабочийДокумент),ЭтаФорма,Новый УникальныйИдентификатор);
				
			Иначе
				
				ОткрытьФорму("Отчет.ДвиженияНастраиваемойОтчетности.Форма",Новый Структура("Документ",РабочийДокумент),ЭтаФорма,Новый УникальныйИдентификатор);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Отбор) И Параметры.Отбор.Свойство("ИсходныйДокумент") Тогда
		
		ИсходныйДокумент=Параметры.Отбор.ИсходныйДокумент;
		ПолучитьСвойстваДокумента();
		
		Элементы.ГруппаОтразитьДокумент.Видимость=Истина;
		Элементы.СписокОбработатьДокументы.Видимость=Ложь;
		
	Иначе
		
		Элементы.ГруппаОтразитьДокумент.Видимость=Ложь;
		Элементы.СписокОбработатьДокументы.Видимость=Истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвойстваДокумента()
	
	ДокументОбъект=ИсходныйДокумент.ПолучитьОбъект();
	
	ИсходныйДокументПометкаУдаления=ДокументОбъект.ПометкаУдаления;
	ИсходныйДокументПроведен=ДокументОбъект.Проведен;
	
	ДокументОбъект=Неопределено;
			
КонецПроцедуры // ПолучитьСвойстваДокумента()

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ=Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИсходныйДокументНаСервере()
	
	ДокументОбъект=ИсходныйДокумент.ПолучитьОбъект();
	Обработки.КорректировкиЗначенийПоказателей.ПроверитьОбработатьКорректировкиПоШаблонам(ДокументОбъект,Ложь);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДокумент(Команда)
	
	Если ИсходныйДокументПометкаУдаления Тогда
		
		ПоказатьПредупреждение(,Нстр("ru = 'Исходный документ помечен на удаление. Отражение по шаблонам невозможно.'"),60);
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ИсходныйДокументПроведен Тогда
		
		ПоказатьПредупреждение(,Нстр("ru = 'Исходный документ не проведен. Отражение по шаблонам невозможно.'"),60);
		Возврат;
		
	КонецЕсли;
	
	ОбработатьИсходныйДокументНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыделенныеДокументы(ВключаяОбработанные)
	
	МассивДокументов=Новый Массив;
	
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		
		МассивДокументов.Добавить(Строка);
		
	КонецЦикла;
	
	ОбработатьМассивДокументовНаСервере(Новый ФиксированныйМассив(МассивДокументов),ВключаяОбработанные);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеЗакрытияПериода(Организация,КэшДанныхЗакрытия)
	
	ДанныеЗакрытияПериода=КэшДанныхЗакрытия.Получить(Организация);
	
	Если ДанныеЗакрытияПериода=Неопределено Тогда
		
		ДанныеЗакрытияПериода=УправлениеОтчетамиУХ.ПолучитьДанныеЗакрытогоПериода(Организация);
		КэшДанныхЗакрытия.Вставить(Организация,ДанныеЗакрытияПериода);
		
	КонецЕсли;
	
	Возврат ДанныеЗакрытияПериода;
			
КонецФункции // ПолучитьДанныеЗакрытияПериода() 

&НаСервере
Функция ОбработатьМассивДокументовНаСервере(ВключаяОбработанные,МассивДокументов=Неопределено)
	
	Если МассивДокументов=Неопределено Тогда
		
		Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТаблицаЗначений = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		МассивДокументов=ТаблицаЗначений.ВыгрузитьКолонку("ИсходныйДокумент");
				
	КонецЕсли;
		
	Возврат КорректировкиЗначенийПоказателей32.ОбработатьМассивДокументов(МассивДокументов,Новый Структура("ВключаяОбработанные",ВключаяОбработанные));
	
КонецФункции // ОбработатьМассивДокументовНаСервере()
